In [73]:
import numpy as np
import pandas as pd

df_marathon = pd.read_table("marathon.txt", header = None, names=['city', 'year', 'time', 'sec'])

df_marathon

        city  year      time   sec
0      PARIS  2011  02:06:29  7589
1      PARIS  2010  02:06:41  7601
2      PARIS  2009  02:05:47  7547
3      PARIS  2008  02:06:40  7600
4      PARIS  2007  02:07:17  7637
..       ...   ...       ...   ...
354  CHICAGO  2006  02:07:35  7655
355  CHICAGO  2007  02:11:11  7871
356  CHICAGO  2008  02:06:25  7585
357  CHICAGO  2009  02:05:41  7541
358  CHICAGO  2010  02:06:23  7583

[359 rows x 4 columns]

In [74]:
# Je crée une colone avec la valeur 1 en ligne quand la ville lui correspond

df_marathon['est_paris'] = df_marathon['city'] =='PARIS'
df_marathon['est_paris'] = df_marathon['est_paris'].replace(True, 1).replace(False, 0)

df_marathon['est_berlin'] = df_marathon['city'] =='BERLIN'
df_marathon['est_berlin'] = df_marathon['est_berlin'].replace(True, 1).replace(False, 0)


df_marathon.head( n = 3)

    city  year      time   sec  est_paris  est_berlin
0  PARIS  2011  02:06:29  7589          1           0
1  PARIS  2010  02:06:41  7601          1           0
2  PARIS  2009  02:05:47  7547          1           0

In [77]:
# je crée une matrice X de taille (3, 359)  et une matrice colonne Y de taille (1, 359)
X = np.matrix(df_marathon[["year", "est_paris", "est_berlin"]])
Y = np.matrix(df_marathon[["sec"]])

In [78]:
#J'applique le calcul pour créer ma matrice A, 
# .T permet de transposer et .I permet d'avoir l'inverse de la matrice

A = (X.T * X).I * X.T * Y

A

matrix([[  3.98807104],
        [-13.47591572],
        [-23.91576442]])

In [80]:
# J'affiche les coefficient correspondant à chaque permier élément des lignes de ma nouvelle matrice
(A[0,0], A[1,0], A[2,0] )

(3.98807104335788, -13.475915722748393, -23.915764416891946)